In [1]:
import pandas as pd
import numpy as np

import wrangle as w
import explore as e

import matplotlib.pyplot as plt
import seaborn as sns

from datetime import datetime

import statsmodels.api as sm
from statsmodels.tsa.api import Holt, ExponentialSmoothing
np.random.seed(0)

from sklearn.metrics import mean_squared_error
from math import sqrt 


import warnings 
warnings.filterwarnings('ignore')

In [2]:
mon_sa = w.sales('monthly_home_sales_sa.csv')
mon_aus = w.sales('monthly_aus.csv')
mon_dal = w.sales('monthly_dal.csv')
mon_hou = w.sales('monthly_hou.csv')

In [3]:
df = e.comparing_markets(mon_sa,mon_aus,mon_dal, mon_hou, keys=['san antonio', 'austin', 'dallas', 'houston'])

In [6]:
mon_aus

,sales,dollar_volume,average_price,median_price,total_listings,months_inventory
date,,,,,,
1990-01-01,558,46937286,84117,71000,4391,7.9
1990-02-01,444,37056240,83460,71199,4343,8.7
1990-03-01,431,34722653,80563,72497,4459,9.3
1990-04-01,569,34616822,60838,71998,4545,9.1
1990-05-01,549,44907102,81798,73694,4731,9.3
...,...,...,...,...,...,...
2022-11-01,2055,1183522245,575923,464000,8738,3.0
2022-12-01,2508,1384506103,552036,450000,7416,2.6
2023-01-01,1630,907597030,556808,449990,7243,2.6
2023-02-01,2132,1145147523,537124,435000,7120,2.6
2023-03-01,2770,1560892188,563499,450000,8030,3.0

In [7]:
students = {"name" : ["Tim Voss", "Nicole Johnson", "Elsa Williams", "John James", "Catherine Jones"], "age" : [19, 20, 21, 20, 23], "favorite_color" : ["red", "yellow", "green", "blue", "green"], "grade" : [91, 95, 82, 75, 93]}

students_df = pd.DataFrame(students)

In [8]:

students_df

              name  age favorite_color  grade
0         Tim Voss   19            red     91
1   Nicole Johnson   20         yellow     95
2    Elsa Williams   21          green     82
3       John James   20           blue     75
4  Catherine Jones   23          green     93

In [15]:
def grades_colors(df):
    df = pd.DataFrame(df) 
    color_filtered = df['favorite_color'].str.contains('red'|'green', regex=True)
    grade_filtered = df[df['grade'] >= 90]
    
    filtered_df = df[color_filtered & grade_filtered]
    return filtered_df

In [16]:
grades_colors(students)

TypeError: unsupported operand type(s) for |: 'str' and 'str'

In [17]:
import pandas as pd

def grades_colors(df):
    df = pd.DataFrame(df)  # Convert list of dictionaries to a DataFrame
    color_filtered = df['favorite_color'].str.contains('red|green', regex=True)
    grade_filtered = df['grade'] >= 90
    
    filtered_df = df[color_filtered & grade_filtered]
    return filtered_df

In [18]:

filtered_students = grades_colors(students_df)

In [19]:
filtered_students

              name  age favorite_color  grade
0         Tim Voss   19            red     91
4  Catherine Jones   23          green     93

In [20]:
students_df['grade'] >= 90

0     True
1     True
2    False
3    False
4     True
Name: grade, dtype: bool

In [21]:
students_df

              name  age favorite_color  grade
0         Tim Voss   19            red     91
1   Nicole Johnson   20         yellow     95
2    Elsa Williams   21          green     82
3       John James   20           blue     75
4  Catherine Jones   23          green     93

In [23]:
students_df[(students_df['grade'] >= 90) & (students_df['favorite_color'].isin(['red','green']))]

              name  age favorite_color  grade
0         Tim Voss   19            red     91
4  Catherine Jones   23          green     93